# Copyright 2023 Adobe
# All Rights Reserved.

# NOTICE: Adobe permits you to use, modify, and distribute this file in
# accordance with the terms of the Adobe license agreement accompanying
# it.

abc = (
    # not hooked up
    """ABCDEFGHIJKLMNOPQRSTUVWXYZ"""
    """abcdefghijklmnopqrstuvwxyz"""
)
ascii = (
    r""" !"#$%&'()*+,-./0123456789:;<=>?"""
    r"""@ABCDEFGHIJKLMNOPQRSTUVWXYZ[\]^_`"""
    r"""abcdefghijklmnopqrstuvwxyz{|}~"""
)

ag1 = (
    """ ;΄΅Ά·ΈΉΊΌΎΏΐΑΒΓΔΕΖΗΘΙΚΛΜΝΞΟΠΡΣΤΥΦΧΨΩΪΫ"""
    """άέήίΰαβγδεζηθικλμνξοπρςστυφχψωϊϋόύώ"""
)

ag2 = (
    """  ͂̓̈́ͅʹ͵ͺ;΄΅Ά·ΈΉΊΌΎΏΐΑΒΓΔΕΖΗΘΙΚΛΜΝΞΟΠΡΣΤΥΦΧΨΩΪΫ"""
    """άέήίΰαβγδεζηθικλμνξοπρςστυφχψωϊϋόύώϗἀἁἂἃἄἅἆἇ"""
    """ἈἉἊἋἌἍἎἏἐἑἒἓἔἕἘἙἚἛἜἝἠἡἢἣἤἥἦἧἨἩἪἫἬἭἮἯ"""
    """ἰἱἲἳἴἵἶἷἸἹἺἻἼἽἾἿὀὁὂὃὄὅὈὉὊὋὌὍὐὑὒὓὔὕὖὗὙὛὝὟ"""
    """ὠὡὢὣὤὥὦὧὨὩὪὫὬὭὮὯὰάὲέὴήὶίὸόὺύὼώᾀᾁᾂᾃᾄᾅᾆᾇ"""
    """ᾈᾉᾊᾋᾌᾍᾎᾏᾐᾑᾒᾓᾔᾕᾖᾗᾘᾙᾚᾛᾜᾝᾞᾟᾠᾡᾢᾣᾤᾥᾦᾧ"""
    """ᾨᾩᾪᾫᾬᾭᾮᾯᾰᾱᾲᾳᾴᾶᾷᾸᾹᾺΆᾼ᾽ι᾿῀῁ῂῃῄῆῇ"""
    """ῈΈῊΉῌ῍῎῏ῐῑῒΐῖῗῘῙῚΊ῝῞῟ῠῡῢΰῤῥῦῧῨῩῪΎῬ῭΅`ῲῳῴῶῷῸΌῺΏῼ´῾"""
)

ac1 = (
    """ ЀЁЂЃЄЅІЇЈЉЊЋЌЍЎЏАБВГДЕЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯ"""
    """абвгдежзийклмнопрстуфхцчшщъыьэюяѐёђѓєѕіїјљњћќѝўџѢѣѲѳѴѵҐґ₴₽№"""
)

ac2 = (
    """ ЀЁЂЃЄЅІЇЈЉЊЋЌЍЎЏАБВГДЕЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯ"""
    """абвгдежзийклмнопрстуфхцчшщъыьэюяѐёђѓєѕіїјљњћќѝўџ"""
    """ѢѣѲѳѴѵҐґҒғҖҗҘҙҚқҠҡҢңҪҫҮүҰұҲҳҶҷҺһӀӁӂӏӐӑӔӕӖӗӘәӢӣӦӧӨөӮӯӲӳ₮₴₸₽№"""
)

ac3 = (
    """ ЀЁЂЃЄЅІЇЈЉЊЋЌЍЎЏАБВГДЕЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯ"""
    """абвгдежзийклмнопрстуфхцчшщъыьэюяѐёђѓєѕіїјљњћќѝўџѢѣѪѫ"""
    """ѲѳѴѵҐґҒғҔҕҖҗҘҙҚқҜҝҞҟҠҡҢңҤҥҦҧҨҩҪҫҬҭҮүҰұҲҳҴҵҶҷҸҹҺһҼҽҾҿ"""
    """ӀӁӂӋӌӏӐӑӒӓӔӕӖӗӘәӜӝӞӟӠӡӢӣӤӥӦӧӨөӮӯӰӱӲӳӴӵӶӷӸӹԚԛԜԝԤԥ₮₴₸₽№"""
)

al1 = (
    r""" !"#$%&'()*+,-./0123456789:;<=>?@ABCDEFGHIJKLMNOPQRSTUVWXYZ"""
    r"""[\]^_`abcdefghijklmnopqrstuvwxyz{|}~¡¢£¤¥¦§¨©ª«¬®¯°±²³´µ¶·¸¹º»"""
    r"""¼½¾¿ÀÁÂÃÄÅÆÇÈÉÊËÌÍÎÏÐÑÒÓÔÕÖ×ØÙÚÛÜÝÞßàáâãäåæçèéêëìíîïðñòóôõö÷ø"""
    r"""ùúûüýþÿıŁłŒœŠšŸŽžƒˆˇ˘˙˚˛˜˝–—‘’‚“”„†‡•…‰‹›⁄€™−ﬁﬂ"""
)

al2 = (
    r""" !"#$%&'()*+,-./0123456789:;<=>?@ABCDEFGHIJKLMNOPQRSTUVWXYZ"""
    r"""[\]^_`abcdefghijklmnopqrstuvwxyz{|}~¡¢£¤¥¦§¨©ª«¬­­®¯°±²³´µ¶·¸¹º»"""
    r"""¼½¾¿ÀÁÂÃÄÅÆÇÈÉÊËÌÍÎÏÐÑÒÓÔÕÖ×ØÙÚÛÜÝÞßàáâãäåæçèéêëìíîïðñòóôõö÷ø"""
    r"""ùúûüýþÿıŁłŒœŠšŸŽžƒˆˇˉ˘˙˚˛˜˝π–—‘’‚“”„†‡•…‰‹›⁄€ℓ™Ω℮∂∆∏∑−∕∙√∞∫≈≠≤≥◊ﬁﬂ"""
)

al3 = (
    r""" !"#$%&'()*+,-./0123456789:;<=>?@ABCDEFGHIJKLMNOPQRSTUVWXYZ"""
    r"""[\]^_`abcdefghijklmnopqrstuvwxyz{|}~¡¢£¤¥¦§¨©ª«¬­®¯°±²³´µ¶·¸¹º"""
    r"""»¼½¾¿ÀÁÂÃÄÅÆÇÈÉÊËÌÍÎÏÐÑÒÓÔÕÖ×ØÙÚÛÜÝÞßàáâãäåæçèéêëìíîïðñòóôõö"""
    r"""÷øùúûüýþÿĀāĂăĄąĆćČčĎďĐđĒēĖėĘęĚěĞğĢģĪīĮįİıĶķĹĺĻļĽľŁłŃńŅņŇňŌōŐőŒœ"""
    r"""ŔŕŖŗŘřŚśŞşŠšŢţŤťŪūŮůŰűŲųŸŹźŻżŽžƒȘșȚțˆˇˉ˘˙˚˛˜˝π–—‘’‚“”„†‡•…‰‹›⁄€₺₽"""
    r"""ℓ™Ω℮∂∆∏∑−∕∙√∞∫≈≠≤≥◊ﬁﬂ"""
)

al4 = (
    r""" !"#$%&'()*+,-./0123456789:;<=>?@ABCDEFGHIJKLMNOPQRSTUVWXYZ"""
    r"""[\]^_`abcdefghijklmnopqrstuvwxyz{|}~ ¡¢£¤¥¦§¨©ª«¬­®¯°±²³´µ¶·"""
    r"""¸¹º»¼½¾¿ÀÁÂÃÄÅÆÇÈÉÊËÌÍÎÏÐÑÒÓÔÕÖ×ØÙÚÛÜÝÞßàáâãäåæçèéêëìíîïðñ"""
    r"""òóôõö÷øùúûüýþÿĀāĂăĄąĆćĈĉĊċČčĎďĐđĒēĔĕĖėĘęĚěĜĝĞğĠġĢģĤĥĦħĨĩĪī"""
    r"""ĮįİıĴĵĶķĸĹĺĻļĽľĿŀŁłŃńŅņŇňŉŌōŐőŒœŔŕŖŗŘřŚśŜŝŞşŠšŢţŤťŨũŪūŬŭŮů"""
    r"""ŰűŲųŴŵŶŷŸŹźŻżŽžƏƒƠơƯưǍǎǏǐǑǒǓǔǕǖǗǘǙǚǛǜǦǧȘșȚțȷɑəɡ"""
    r"""ʻʼʾʿˆˇˈˉˊˋˌ˘˙˚˛˜˝̧̨̛̣̤̦̮̱̀́̂̃̄̆̇̈̉̊̋̌πḌḍḎḏḠḡḤḥḪḫḶḷḸḹḺḻ"""
    r"""ṂṃṄṅṆṇṈṉṚṛṜṝṞṟṠṡṢṣṬṭṮṯẀẁẂẃẄẅẎẏẒẓẗẞẠạẢảẤấẦầẨẩẪẫẬậẮắẰằẲẳẴẵ"""
    r"""ẶặẸẹẺẻẼẽẾếỀềỂểỄễỆệỈỉỊịỌọỎỏỐốỒồỔổỖỗỘộỚớỜờỞởỠỡỢợỤụỦủỨứỪừỬửỮữỰựỲỳỴỵỶỷỸỹ"""
    r""" ‐‒–—―‘’‚“”„†‡•…‰′″‹›⁄⁰⁴⁵⁶⁷⁸⁹⁽⁾ⁿ₀₁₂₃₄₅₆₇₈₉₍₎"""
    """₡₤₦₧₫€₱₲₵₹₺₽ℓ℗℠™Ω℮⅓⅔⅛⅜⅝⅞"""
    r"""←↑→↓∂∆∏∑−∕∙√∞∫≈≠≤≥■▲△▶▷▼▽◀◁◆◊ﬁﬂ""")

al5 = (
    r""" !"#$%&'()*+,-./0123456789:;<=>?@ABCDEFGHIJKLMNOPQRSTUVWXYZ"""
    r"""[\]^_`abcdefghijklmnopqrstuvwxyz{|}~ ¡¢£¤¥¦§¨©ª«¬­®¯°±²³´µ¶·"""
    r"""¸¹º»¼½¾¿ÀÁÂÃÄÅÆÇÈÉÊËÌÍÎÏÐÑÒÓÔÕÖ×ØÙÚÛÜÝÞßàáâãäåæçèéêëìíîïðñ"""
    r"""òóôõö÷øùúûüýþÿĀāĂăĄąĆćĈĉĊċČčĎďĐđĒēĔĕĖėĘęĚěĜĝĞğĠġĢģĤĥĦħĨĩĪī"""
    r"""ĬĭĮįİıĲĳĴĵĶķĸĹĺĻļĽľĿŀŁłŃńŅņŇňŉŊŋŌōŎŏŐőŒœŔŕŖŗŘřŚśŜŝŞşŠšŢţŤť"""
    r"""ŦŧŨũŪūŬŭŮůŰűŲųŴŵŶŷŸŹźŻżŽžſƀƁƆƇƈƉƊƎƏƐƑƒƓƔƖƗƘƙƚƛƜƝƞƟƠơƤƥƩƬƭƮƯư"""
    r"""ƱƲƳƴƵƶƷƸƹǀǁǂǃǄǅǆǇǈǉǊǋǌǍǎǏǐǑǒǓǔǕǖǗǘǙǚǛǜǝǞǟǠǡǢǣǤǥǦǧǨǩǪǫǬǭǮǯǰǱǲǳ"""
    r"""ǴǵǸǹǺǻǼǽǾǿȀȁȂȃȄȅȆȇȈȉȊȋȌȍȎȏȐȑȒȓȔȕȖȗȘșȚțȜȝȞȟȠȦȧȨȩȪȫȬȭȮȯȰȱȲȳȷȽɁɂ"""
    r"""ɃɄɅɈɉɊɋɌɍɎɏɐɑɒɓɔɕɖɗɘəɚɛɜɝɞɟɠɡɢɣɤɥɦɧɨɩɪɫɬɭɮɯɰɱɲɳɴɵɶɷɸɹɺɻɼɽɾɿʀʁʂʃʄʅʆʇʈ"""
    r"""ʉʊʋʌʍʎʏʐʑʒʓʔʕʖʗʘʙʚʛʜʝʞʟʠʡʢʣʤʥʦʧʨʩʪʫʬʭʮʯʰʱʲʳʴʵʶʷʸʹʺʻʼʽʾʿˀˁ˂˃˄˅ˆˇˈˉˊˋ"""
    r"""ˌˍˎˏːˑ˒˓˔˕˖˗˘˙˚˛˜˝˞˟ˠˡˢˣˤ˥˦˧˨˩˪˫ˬ˭ˮ˯˰˱˲˳˴˵˶˷˸˹˺˻˼˽˾˿̴̵̶̷̸̡̢̧̨̛̖̗̘̙̜̝̞̟̠̣̤̥̦̩̪̫̬̭̮̯̰̱̲̳̹̺̻̼͇͈͉͍͎͓͔͕͖͙͚̀́̂̃̄̅̆̇̈̉̊̋̌̍̎̏̑̒̓̔̽̾̿̀́͂̓̈́͆͊͋͌͐͑͒͗͛ͣͤͥͦͧͨͩͪͫͬͭͮͯ̕̚͘͜͟͢͝͞͠͡ͅ"""
    r"""Ωβγθλπφχᴅᵚᵛᵝᵞᵠᵡᵻᵼᵽᶜᶞᶠᶨᶻᶿ᷄᷅᷆᷇ḀḁḂḃḄḅḆḇḈḉḊḋḌḍḎḏḐḑḒḓḔḕḖḗḘḙḚḛḜḝḞḟḠḡ"""
    r"""ḢḣḤḥḦḧḨḩḪḫḬḭḮḯḰḱḲḳḴḵḶḷḸḹḺḻḼḽḾḿṀṁṂṃṄṅṆṇṈṉṊṋṌṍṎṏṐṑṒṓṔṕṖṗṘṙṚṛṜṝṞṟ"""
    r"""ṠṡṢṣṤṥṦṧṨṩṪṫṬṭṮṯṰṱṲṳṴṵṶṷṸṹṺṻṼṽṾṿẀẁẂẃẄẅẆẇẈẉẊẋẌẍẎẏẐẑẒẓẔẕẖ"""
    r"""ẗẙẞẠạẢảẤấẦầẨẩẪẫẬậẮắẰằẲẳẴẵẶặẸẹẺẻẼẽẾếỀềỂểỄễỆệỈỉỊị"""
    r"""ỌọỎỏỐốỒồỔổỖỗỘộỚớỜờỞởỠỡỢợỤụỦủỨứỪừỬửỮữỰựỲỳỴỵỶỷỸỹ"""
    r""" ‌‍‎‏‐‑‒–—―‖‗‘’‚‛“”„‟†‡•…‰′″‹›‼‾⁄⁰⁴⁵⁶⁷⁸⁹⁺⁻⁼⁽⁾ⁿ"""
    r"""₀₁₂₃₄₅₆₇₈₉₍₎₊₋₌₡₣₤₦₧₨₩₪₫€₭₮₰₱₲₳₵₹₺₽℅ℓ℗℞℠™Ω℮⅓⅔⅛⅜⅝⅞"""
    r"""←↑→↓↔↕↨∂∆∏∑−∕∙√∞∟∩∫≈≠≡≤≥⌂⌐■□▪▫▲△▶▷▼▽◀◁◆◉◊○◌●◦☐☑☺☻☼♀♂♠♣♥♦♪♫♬♾✓❒⟨⟩"""
    r"""ⱢⱣⱤⱭⱮⱯⱰⱱⱲⱳ꞉꞊ꞋꞌꞍꞎꞪꞫꞬꞭꞮꞰꞱꞲꞳꞴꞵꞶꞷꭓﬁﬂ�""")
